In [57]:
import pandas as pd
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
from sklearn import neighbors

In [58]:
data=pd.read_csv("train.csv")

In [59]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [60]:
data.drop(["PassengerId","Name","Ticket","Cabin"], axis=1, inplace=True)

In [61]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [62]:
le=preprocessing.LabelEncoder()

In [63]:
data["Sex"]=le.fit(data["Sex"]).transform(data["Sex"])

In [64]:
data["Embarked"]=le.fit(data["Embarked"]).transform(data["Embarked"])

In [66]:
data["Age"]=data["Age"].round()

In [67]:
data["Fare"]=data["Fare"].round()

In [27]:
y=data["Pclass"]

In [28]:
X=data.drop("Pclass",axis=1)

In [29]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=0)

In [45]:
knn = neighbors.KNeighborsClassifier(n_neighbors=1)

In [46]:
knn.fit(X_train,y_train).score(X_test,y_test)

0.8913857677902621

In [47]:
y_pred=knn.predict(X_test)

In [44]:
confusion_matrix(y_test,y_pred)

array([[ 62,   6,   2],
       [  3,  37,   9],
       [  1,   8, 139]], dtype=int64)